def first():
    print('Вы выбрали первое задание\n Введите строку')
    s=str(input())
    s=s.lower()
    s1=s.split()
    l=len(s1)
    k=0
    s=""
    while k<l:
        if s1[k][0:2]=="ли":
            s=s+s1[k]+" "
        k+=1

    print(s)
    pass


def sec():
    print('Вы выбрали второе задание ')
    my_string = "Ф;И;О;Возраст;Категория;_Иванов;Иван;Иванович;23 года;Студент 3 курса;_Петров;Семен;Игоревич;22 года;Студент 2 курса"
    s= my_string.split(';')
    s[5]="Иванов"
    s[10]="Петров"
    print(" "*10,s[0],s[1],s[2]," "*20,s[3]," "*20,s[4])
    print(s[5],s[6],s[7]," "*14, s[8]," "*15, s[9])
    print(s[10],s[11],s[12]," "*13, s[13]," "*15, s[14])
    pass


def third():
    print('Вы выбрали третье задание ')
    my_string = "ФИО;Возраст;Категория;_Иванов Иван Иванович;23 года;Студент 3 курса;_Петров Семен Игоревич;22 года;Студент 2 курса;_Иванов Семен Игоревич;22 года;Студент 2 курса;_Акибов Ярослав Наумович;23 года;Студент 3 курса;_Борков Станислав Максимович;21 год;Студент 1 курса;_Петров Семен Семенович;21 год;Студент 1 курса;_Романов Станислав Андреевич;23 года;Студент 3 курса;_Петров Всеволод Борисович;21 год;Студент 2 курса"
    s=my_string.split(";")
    for i in range (7,28,3):
        if int(s[i][0:2])==21:
            print(s[i-1]," "*5,s[i]," "*5,s[i+1])


def fourth():
    print('Вы выбрали четвёртое задание ')
    print("Введите количество элементов:")
    n=int(input())
    a=[]
    k=1
    while k<=n:
        x=int(input())
        if x%2!=0:
            a.append(x)
        k+=1
    print("Введите 2 дополнительных элемента:")
    a.append(int(input()))
    a.append(int(input()))
    print(a)
    pass


print('Введите номер задания: ')
task=int(input())
if task == 1:
    first()
elif task == 2:
    sec()
elif task == 3:
    third()
elif task == 4:
    fourth()
